/* REXX */
/*----------------------------------------------------------------*/
/* Copyright Contributors to the zOS-Workflow Project.            */
/* PDX-License-Identifier: Apache-2.0                             */
/*----------------------------------------------------------------*/

CLIENT_GROUP="${instance-GENERIC_CLIENT_GROUP}"
SAF_OWNER="${instance-SAF_OWNER}"
SAFPREFIX="${instance-SAF_PROFILE_PREFIX}"



/*******************************************************************/
/* CSFSERV                          */
/*******************************************************************/

/* access to random number generator, without, no client ssl connection */
"PERMIT CSFRNGL CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"

/* all verbs */
"PERMIT CSF1DMK CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1DVK CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1GAV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1GKP CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1GSK CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1HMG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1HMV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1PKS CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1PKV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1SAV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1SKD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1SKE CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1SKR CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1TRC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1TRD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1TRL CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1UWK CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF1WPK CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFAPG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCKC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCKI CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCPA CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCPE CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCRC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCSG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCSV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCTT2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCVT CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDCM CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDCO CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDCU2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDDK CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDDPG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDKG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDKG2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDKM CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDKX CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDMP CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDPC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDPCG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDPMT CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDPNU CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDPT CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDPV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDRG2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDRP CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDRPG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDSK CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFEAC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFECO CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFEDH CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFEPG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFESC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFEVF CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFFFXD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFFFXE CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFFFXT CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFFPED CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFFPEE CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFFPET CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFGIM CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFHMG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFHMV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFIQA CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKDMW CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKDU CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKEX CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKGN2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKIM CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKPI CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKPI2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKRC2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKRR CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKRR2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKRW CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKRW2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKTR CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKTR2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKYT2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKYTX CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFMDG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFMGN CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFMGN2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFMMS CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFMPS CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFMVR CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFMVR2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPCU CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPEX CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPEXX CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPFO CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPGN CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPIC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKRR CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKRW CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKT CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPRR2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPTR CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPTR2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPTRE CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPVR CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPVR2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFRKA CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFRKX CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFRRT CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSAD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSAE CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSBC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSBD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSKI CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSKI2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSKM CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSKY CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSPN CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSXD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSYG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSYI2 CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFT31C CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFT31I CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFT31X CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFT34B CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFT34C CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFT34D CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFT34R CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFTBC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFTRV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFUKD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"

/* sunshine test*/
"PERMIT CSFIQF CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPCI CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFIQF CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCKM CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFCVE CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDEC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFENC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKET CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKGN CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKRC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKRD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFKYT CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFOWH CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFRNG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDSG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFDSV CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKRC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKRD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKTC CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKE CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKG CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKI CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFPKX CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFRKD CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFRKL CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSYI CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSFSYX CL(CSFSERV) ACCESS(READ) ID("CLIENT_GROUP")"

"SETROPTS RACLIST(CSFSERV) REFRESH"


/* define application id for ACSP, default is ACSPPROD */
/* must match auth.map.applid in server properties */
Say "Grant access to "CLIENT_GROUP" "
"PERMIT "SAFPREFIX" CLASS(APPL) ACCESS(READ) ID("CLIENT_GROUP")"
Say "Refresh APPL"
"SETROPTS RACLIST(APPL) REFRESH"


/* ************************************************************ */
/* Key access */
/* ************************************************************ */

/* If ICSF keystore policy checking is active and the  */
/* CSF.PKDS.TOKEN.CHECK.DEFAULT.LABEL resource in XFACILIT class is  */
/* defined, the CSF-PKDS-DEFAULT resource in CSFKEYS class must also  */
/* be defined and the Client's <task-user> needs access.*/
Say "Granting access to "CLIENT_GROUP" for keystore checking"
"PERMIT CSF-PKDS-DEFAULT CLASS(CSFKEYS) ACCESS(READ) ID("CLIENT_GROUP")"
"PERMIT CSF-CKDS-DEFAULT CLASS(CSFKEYS) ACCESS(READ) ID("CLIENT_GROUP")"

Say "Refreshing CSFKEYS"
"SETROPTS RACLIST(CSFKEYS) REFRESH"

/* ************************************************************ */
/* Client Protocol acccess */
/* ************************************************************ */
/* ACSP auto configuration protocol profile resources */
Say "defining client access for auto config protogol"
"RDEF XFACILIT ACSP.PROTOCOL.ACP UACC(READ) OWNER("SAF_OWNER") "
"PERMIT ACSP.PROTOCOL.ACP CLASS(XFACILIT) ACCESS(READ) ID("CLIENT_GROUP")"

/* CCA access */
Say "defining client access for CCA"
"RDEF XFACILIT ACSP.PROTOCOL.CCA UACC(READ) OWNER("SAF_OWNER") "
"PERMIT ACSP.PROTOCOL.CCA CLASS(XFACILIT) ACCESS(READ) ID("CLIENT_GROUP")"

/* command client access */
Say "defining client access for command line"
"RDEF XFACILIT ACSP.PROTOCOL.CCC UACC(NONE) OWNER("SAF_OWNER") "
"PERMIT ACSP.PROTOCOL.CCC CLASS(XFACILIT) ACCESS(READ) ID("CLIENT_GROUP")"

/* REFRESH" */
Say "Refreshing XFACILIT"
"SETROPTS RACLIST(XFACILIT) REFRESH"

/* ************************************************************ */
/* client key record acccess */
/* ************************************************************ */

/* Allows access to list AES, DES and PKA key records */
/* in ICSF CKDS and PKDS.  */
Say "Define general access to list key records"
"RDEF XFACILIT ACSP.KEYRECORD.LIST UACC(READ) OWNER("SAF_OWNER") "
"PERMIT ACSP.KEYRECORD.LIST CLASS(XFACILIT)" ,
   " ACCESS(READ) ID("CLIENT_GROUP")"

/* Allows access to list AES key records */
/* in ICSF CKDS and PKDS.  */
Say "Define general access to list key records"
"RDEF XFACILIT ACSP.KEYRECORD.LIST.AES UACC(READ) OWNER("SAF_OWNER") ",
"PERMIT ACSP.KEYRECORD.LIST.AES CLASS(XFACILIT) ",
  "ACCESS(READ) ID("CLIENT_GROUP")"

/* Allows access to list DES key records */
/* in ICSF CKDS and PKDS.  */
Say "Define access to list DES records"
"RDEF XFACILIT ACSP.KEYRECORD.LIST.DES UACC(READ) OWNER("SAF_OWNER") "
"PERMIT ACSP.KEYRECORD.LIST.DES CLASS(XFACILIT) ",
  "ACCESS(READ) ID("CLIENT_GROUP")"

/* Allows access to list PKA key records */
/* in ICSF CKDS and PKDS.  */
Say "Define acccess to list PKA records"
"RDEF XFACILIT ACSP.KEYRECORD.LIST.PKA UACC(READ) OWNER("SAF_OWNER") "
"PERMIT ACSP.KEYRECORD.LIST.PKA CLASS(XFACILIT) ",
  "ACCESS(READ) ID("CLIENT_GROUP")"

/* REFRESH" */
Say "Refreshing XFACILIT"
"SETROPTS RACLIST(XFACILIT) REFRESH"

/* ************************************************************ */
/* Operator access */
/* ************************************************************ */

Say "Defining access to commands "
"PERMIT ACSP.COMMAND.CRYPTO   CLASS(XFACILIT) ID("CLIENT_GROUP") ACC(READ)"
"PERMIT ACSP.COMMAND.DISPLAY  CLASS(XFACILIT) ID("CLIENT_GROUP") ACC(READ)"
"PERMIT ACSP.COMMAND.SET      CLASS(XFACILIT) ID("CLIENT_GROUP") ACC(READ)"
"PERMIT ACSP.COMMAND.START    CLASS(XFACILIT) ID("CLIENT_GROUP") ACC(READ)"
"PERMIT ACSP.COMMAND.STOP     CLASS(XFACILIT) ID("CLIENT_GROUP") ACC(READ)"
"PERMIT ACSP.COMMAND.SHUTDOWN CLASS(XFACILIT) ID("CLIENT_GROUP") ACC(READ)"

Say "Refreshing XFACILIT"
"SETROPTS RACLIST(XFACILIT) REFRESH"

/* ************************************************************ */
/* Optional */
/* ************************************************************ */

/* ACSP UDF EXECUTION resources */
/* Optional. Allows execution of all non-built-in UDFs */
/* Say "Defining access to all non-built-in UDFs" */
/* "RDEF XFACILIT ACSP.UDF.EXECUTE UACC(NONE) OWNER("SAF_OWNER") " */
/* "PERMIT ACSP.UDF.EXECUTE CLASS(XFACILIT) ID("CLIENT_GROUP") ACC(READ)" */

/* Optional. Definition enables mapping for the client */
/* "RDEF XFACILIT ACSP.REASONCODE.MAP."CLIENT_GROUP" " , */
   /* " UACC(NONE) OWNER("SAF_OWNER")" */
/* "PERMIT ACSP.REASONCODE.MAP."CLIENT_GROUP" CLASS(XFACILIT) ", */
      /* "ID("CLIENT_GROUP") ACC(READ)" */
/* Optional. Definition enables a user-id prefix. */
/* "RDEF XFACILIT ACSP.KEYLABEL.PREFIX."CLIENT_GROUP" UACC(NONE) ", */
   /* " OWNER("SAF_OWNER")" */
/* "PERMIT ACSP.KEYLABEL.PREFIX."CLIENT_GROUP" CLASS(XFACILIT) ", */
      /* "ID("CLIENT_GROUP") ACC(READ)" */

/* Optional. Definition enables a specific user ID prefix */
/* "RDEF XFACILIT ACSP.KEYLABEL.PREFIX."CLIENT_GROUP".<prefix> ", */
        /* "UACC(NONE) OWNER("SAF_OWNER") " */
/* "PERMIT ACSP.KEYLABEL.PREFIX."CLIENT_GROUP".<prefix> ", */
       /* "CLASS(XFACILIT) ID("CLIENT_GROUP") ACC(READ)" */

/* REFRESH" */
/* Say "Refreshing XFACILIT" */
/* "SETROPTS RACLIST(XFACILIT) REFRESH" */



