//DB2RNSTA  PROC UKODB=,UKOSPAC=
// EXPORT SYMLIST=*
// SET UKODB=&UKODB
// SET UKOSPAC=&UKOSPAC
//RUNSTAT EXEC DSNUPROC,SYSTEM=${instance-DB_JCC_SSID},
//             LIB='${instance-DB_HLQ}.SDSNLOAD',
//             UID='RUNSTATUKO'
//DSNUPROC.SYSIN  DD *,SYMBOLS=JCLONLY
RUNSTATS TABLESPACE(&UKODB..&UKOSPAC)
  TABLE(ALL) INDEX(ALL); 
//DB2RNSTA PEND
//**********************************************
//*
//SKMGAUD EXEC DB2RNSTA,UKODB=${instance-DB_NAME_UKO},UKOSPAC=SKMGAUD