/* REXX */
/*----------------------------------------------------------------*/
/* Copyright Contributors to the zOS-Workflow Project.            */
/* PDX-License-Identifier: Apache-2.0                             */
/*----------------------------------------------------------------*/

CLIENT_GROUP="${instance-GENERIC_CLIENT_GROUP}"
SAF_OWNER="${instance-SAF_OWNER}"
SAFPREFIX="${instance-SAF_PROFILE_PREFIX}"



/*******************************************************************/
/* CSFSERV                          */
/*******************************************************************/

"PERMIT CSFRNGL CL(CSFSERV) DELETE ID("CLIENT_GROUP")"

/* allverbs */
"PERMIT CSF1DMK CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1DVK CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1GAV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1GKP CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1GSK CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1HMG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1HMV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1PKS CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1PKV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1SAV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1SKD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1SKE CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1SKR CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1TRC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1TRD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1TRL CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1UWK CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF1WPK CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFAPG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCKC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCKI CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCPA CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCPE CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCRC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCSG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCSV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCTT2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCVT CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDCM CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDCO CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDCU2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDDK CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDDPG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDKG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDKG2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDKM CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDKX CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDMP CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDPC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDPCG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDPMT CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDPNU CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDPT CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDPV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDRG2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDRP CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDRPG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDSK CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFEAC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFECO CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFEDH CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFEPG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFESC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFEVF CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFFFXD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFFFXE CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFFFXT CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFFPED CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFFPEE CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFFPET CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFGIM CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFHMG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFHMV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFIQA CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKDMW CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKDU CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKEX CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKGN2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKIM CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKPI CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKPI2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKRC2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKRR CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKRR2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKRW CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKRW2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKTR CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKTR2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKYT2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKYTX CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFMDG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFMGN CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFMGN2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFMMS CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFMPS CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFMVR CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFMVR2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPCU CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPEX CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPEXX CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPFO CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPGN CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPIC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKRR CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKRW CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKT CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPRR2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPTR CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPTR2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPTRE CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPVR CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPVR2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFRKA CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFRKX CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFRRT CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSAD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSAE CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSBC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSBD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSKI CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSKI2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSKM CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSKY CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSPN CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSXD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSYG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSYI2 CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFT31C CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFT31I CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFT31X CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFT34B CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFT34C CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFT34D CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFT34R CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFTBC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFTRV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFUKD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"


/* sunshine test*/
"PERMIT CSFIQF CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPCI CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFIQF CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCKM CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFCVE CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDEC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFENC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKET CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKGN CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKRC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKRD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFKYT CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFOWH CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFRNG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDSG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFDSV CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKRC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKRD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKTC CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKE CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKG CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKI CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFPKX CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFRKD CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFRKL CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSYI CL(CSFSERV) DELETE ID("CLIENT_GROUP")"
"PERMIT CSFSYX CL(CSFSERV) DELETE ID("CLIENT_GROUP")"

"SETROPTS RACLIST(CSFSERV) REFRESH"


Say "Remove APPL access from "CLIENT_GROUP" "
"PERMIT "SAFPREFIX" CLASS(APPL) DELETE ID("CLIENT_GROUP")"
Say "Refresh APPL"
"SETROPTS RACLIST(APPL) REFRESH"


/* ************************************************************ */
/* Key access */
/* ************************************************************ */

/* The client needs access to the key labels it works with. */
/* Adjust the profile name accordingly. */
/* When you run the allverbs test, it will check for CONTROL on ** */
Say "remove key access"
"PERMIT ** CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"

Say "Removing access to key profiles for sunshine test"
"PERMIT DKMSEMT.** CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"
"PERMIT ACSP.** CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"
"PERMIT BELH.** CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"
"PERMIT CRSA.** CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"
"PERMIT CDF.** CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"
"PERMIT EMVTXAPI.** CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"
"PERMIT JCCA.** CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"

/* If ICSF keystore policy checking is active and the  */
/* CSF.PKDS.TOKEN.CHECK.DEFAULT.LABEL resource in XFACILIT class is  */
/* defined, the CSF-PKDS-DEFAULT resource in CSFKEYS class must also  */
/* be defined and the Client's <task-user> needs access.*/
Say "Removing access from "CLIENT_GROUP" for keystore checking"
"PERMIT CSF-PKDS-DEFAULT CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"
"PERMIT CSF-CKDS-DEFAULT CLASS(CSFKEYS) DELETE ID("CLIENT_GROUP")"

Say "Refreshing CSFKEYS"
"SETROPTS RACLIST(CSFKEYS) REFRESH"

Say "Removing sunshine test access from cryptoz"
"PERMIT SO.** CLASS(CRYPTOZ) DELETE ID("CLIENT_GROUP")"
"PERMIT USER.** CLASS(CRYPTOZ) DELETE ID("CLIENT_GROUP")"

Say "Refreshing CRYPTOZ"
"SETROPTS RACLIST(CRYPTOZ) REFRESH"

/* ************************************************************ */
/* Client Protocol acccess */
/* ************************************************************ */
/* ACSP auto configuration protocol profile resources */
Say "removing client access from auto config protogol"
"PERMIT ACSP.PROTOCOL.ACP CLASS(XFACILIT) DELETE ID("CLIENT_GROUP")"

/* CCA access */
Say "removing client access from CCA"
"PERMIT ACSP.PROTOCOL.CCA CLASS(XFACILIT) DELETE ID("CLIENT_GROUP")"

/* command client access */
Say "removing client access from command line"
"PERMIT ACSP.PROTOCOL.CCC CLASS(XFACILIT) DELETE ID("CLIENT_GROUP")"

/* REFRESH" */
Say "Refreshing XFACILIT"
"SETROPTS RACLIST(XFACILIT) REFRESH"

/* ************************************************************ */
/* client key record acccess */
/* ************************************************************ */

/* Allows access to list AES, DES and PKA key records */
/* in ICSF CKDS and PKDS.  */
Say "removing general access to list key records"
"PERMIT ACSP.KEYRECORD.LIST CLASS(XFACILIT)" ,
   " DELETE ID("CLIENT_GROUP")"

/* Allows access to list AES key records */
/* in ICSF CKDS and PKDS.  */
Say "removing general access to list key records"
"PERMIT ACSP.KEYRECORD.LIST.AES CLASS(XFACILIT) ",
  "DELETE ID("CLIENT_GROUP")"

/* Allows access to list DES key records */
/* in ICSF CKDS and PKDS.  */
Say "removing access to list DES records"
"PERMIT ACSP.KEYRECORD.LIST.DES CLASS(XFACILIT) ",
  "DELETE ID("CLIENT_GROUP")"

/* Allows access to list PKA key records */
/* in ICSF CKDS and PKDS.  */
Say "removing acccess to list PKA records"
"PERMIT ACSP.KEYRECORD.LIST.PKA CLASS(XFACILIT) ",
  "DELETE ID("CLIENT_GROUP")"

/* REFRESH" */
Say "Refreshing XFACILIT"
"SETROPTS RACLIST(XFACILIT) REFRESH"

/* ************************************************************ */
/* Operator access */
/* ************************************************************ */

Say "Revoming client access from commands"
"PERMIT ACSP.COMMAND.CRYPTO   CLASS(XFACILIT) ID("CLIENT_GROUP") DELETE"
"PERMIT ACSP.COMMAND.DISPLAY  CLASS(XFACILIT) ID("CLIENT_GROUP") DELETE"
"PERMIT ACSP.COMMAND.SET      CLASS(XFACILIT) ID("CLIENT_GROUP") DELETE"
"PERMIT ACSP.COMMAND.START    CLASS(XFACILIT) ID("CLIENT_GROUP") DELETE"
"PERMIT ACSP.COMMAND.STOP     CLASS(XFACILIT) ID("CLIENT_GROUP") DELETE"
"PERMIT ACSP.COMMAND.SHUTDOWN CLASS(XFACILIT) ID("CLIENT_GROUP") DELETE"

Say "Refreshing XFACILIT"
"SETROPTS RACLIST(XFACILIT) REFRESH"

/* ************************************************************ */
/* Optional */
/* ************************************************************ */

/* ACSP UDF EXECUTION resources */
/* Optional. Allows execution of all non-built-in UDFs */
/* Say "Removing access to all non-built-in UDFs" */
/* "PERMIT ACSP.UDF.EXECUTE CLASS(XFACILIT) ID("CLIENT_GROUP") DELETE" */

/* Optional. Definition enables mapping for the client */
/* "PERMIT ACSP.REASONCODE.MAP."CLIENT_GROUP" CLASS(XFACILIT) ", */
      /* "ID("CLIENT_GROUP") DELETE" */

/* Optional. Definition enables a user-id prefix. */
/* "PERMIT ACSP.KEYLABEL.PREFIX."CLIENT_GROUP" CLASS(XFACILIT) ", */
      /* "ID("CLIENT_GROUP") DELETE" */

/* Optional. Definition enables a specific user ID prefix */
/* "PERMIT ACSP.KEYLABEL.PREFIX."CLIENT_GROUP".<prefix> ", */
       /* "CLASS(XFACILIT) ID("CLIENT_GROUP") DELETE" */

/* REFRESH" */
Say "Refreshing XFACILIT"
"SETROPTS RACLIST(XFACILIT) REFRESH"



